7767517
138 154
Input            input0                   0 1 input0
Convolution      Conv_0                   1 1 input0 591 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216
ReLU             LeakyRelu_1              1 1 591 303 0=1.000000e-01
ConvolutionDepthWise Conv_2                   1 1 303 594 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_3              1 1 594 306 0=1.000000e-01
Convolution      Conv_4                   1 1 306 597 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ReLU             LeakyRelu_5              1 1 597 309 0=1.000000e-01
ConvolutionDepthWise Conv_6                   1 1 309 600 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_7              1 1 600 312 0=1.000000e-01
Convolution      Conv_8                   1 1 312 603 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             LeakyRelu_9              1 1 603 315 0=1.000000e-01
ConvolutionDepthWise Conv_10                  1 1 315 606 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_11             1 1 606 318 0=1.000000e-01
Convolution      Conv_12                  1 1 318 609 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_13             1 1 609 321 0=1.000000e-01
ConvolutionDepthWise Conv_14                  1 1 321 612 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_15             1 1 612 324 0=1.000000e-01
Convolution      Conv_16                  1 1 324 615 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_17             1 1 615 327 0=1.000000e-01
ConvolutionDepthWise Conv_18                  1 1 327 618 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_19             1 1 618 330 0=1.000000e-01
Convolution      Conv_20                  1 1 330 621 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             LeakyRelu_21             1 1 621 333 0=1.000000e-01
Split            splitncnn_0              1 2 333 333_splitncnn_0 333_splitncnn_1
ConvolutionDepthWise Conv_22                  1 1 333_splitncnn_1 624 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_23             1 1 624 336 0=1.000000e-01
Convolution      Conv_24                  1 1 336 627 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             LeakyRelu_25             1 1 627 339 0=1.000000e-01
ConvolutionDepthWise Conv_26                  1 1 339 630 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_27             1 1 630 342 0=1.000000e-01
Convolution      Conv_28                  1 1 342 633 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_29             1 1 633 345 0=1.000000e-01
ConvolutionDepthWise Conv_30                  1 1 345 636 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_31             1 1 636 348 0=1.000000e-01
Convolution      Conv_32                  1 1 348 639 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_33             1 1 639 351 0=1.000000e-01
ConvolutionDepthWise Conv_34                  1 1 351 642 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_35             1 1 642 354 0=1.000000e-01
Convolution      Conv_36                  1 1 354 645 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_37             1 1 645 357 0=1.000000e-01
ConvolutionDepthWise Conv_38                  1 1 357 648 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_39             1 1 648 360 0=1.000000e-01
Convolution      Conv_40                  1 1 360 651 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_41             1 1 651 363 0=1.000000e-01
ConvolutionDepthWise Conv_42                  1 1 363 654 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_43             1 1 654 366 0=1.000000e-01
Convolution      Conv_44                  1 1 366 657 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_45             1 1 657 369 0=1.000000e-01
Split            splitncnn_1              1 2 369 369_splitncnn_0 369_splitncnn_1
ConvolutionDepthWise Conv_46                  1 1 369_splitncnn_1 660 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_47             1 1 660 372 0=1.000000e-01
Convolution      Conv_48                  1 1 372 663 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             LeakyRelu_49             1 1 663 375 0=1.000000e-01
ConvolutionDepthWise Conv_50                  1 1 375 666 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             LeakyRelu_51             1 1 666 378 0=1.000000e-01
Convolution      Conv_52                  1 1 378 669 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             LeakyRelu_53             1 1 669 381 0=1.000000e-01
Convolution      Conv_54                  1 1 333_splitncnn_0 672 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             LeakyRelu_55             1 1 672 384 0=1.000000e-01
Convolution      Conv_56                  1 1 369_splitncnn_0 675 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             LeakyRelu_57             1 1 675 387 0=1.000000e-01
Convolution      Conv_58                  1 1 381 678 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_59             1 1 678 390 0=1.000000e-01
Split            splitncnn_2              1 3 390 390_splitncnn_0 390_splitncnn_1 390_splitncnn_2
Interp           Resize_78                1 1 390_splitncnn_2 409 0=1 1=1.000000e+00 2=1.000000e+00 3=30 4=40 6=0
BinaryOp         Add_79                   2 1 387 409 410 0=0
Convolution      Conv_80                  1 1 410 681 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             LeakyRelu_81             1 1 681 413 0=1.000000e-01
Split            splitncnn_3              1 3 413 413_splitncnn_0 413_splitncnn_1 413_splitncnn_2
Interp           Resize_100               1 1 413_splitncnn_2 432 0=1 1=1.000000e+00 2=1.000000e+00 3=60 4=80 6=0
BinaryOp         Add_101                  2 1 384 432 433 0=0
Convolution      Conv_102                 1 1 433 684 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             LeakyRelu_103            1 1 684 436 0=1.000000e-01
Split            splitncnn_4              1 2 436 436_splitncnn_0 436_splitncnn_1
Convolution      Conv_104                 1 1 436_splitncnn_1 687 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      Conv_105                 1 1 436_splitncnn_0 690 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_106            1 1 690 441 0=1.000000e-01
Split            splitncnn_5              1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution      Conv_107                 1 1 441_splitncnn_1 693 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      Conv_108                 1 1 441_splitncnn_0 696 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_109            1 1 696 446 0=1.000000e-01
Convolution      Conv_110                 1 1 446 699 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           Concat_111               3 1 687 693 699 449 0=0
ReLU             Relu_112                 1 1 449 450
Split            splitncnn_6              1 3 450 450_splitncnn_0 450_splitncnn_1 450_splitncnn_2
Convolution      Conv_113                 1 1 413_splitncnn_1 702 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      Conv_114                 1 1 413_splitncnn_0 705 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_115            1 1 705 455 0=1.000000e-01
Split            splitncnn_7              1 2 455 455_splitncnn_0 455_splitncnn_1
Convolution      Conv_116                 1 1 455_splitncnn_1 708 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      Conv_117                 1 1 455_splitncnn_0 711 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_118            1 1 711 460 0=1.000000e-01
Convolution      Conv_119                 1 1 460 714 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           Concat_120               3 1 702 708 714 463 0=0
ReLU             Relu_121                 1 1 463 464
Split            splitncnn_8              1 3 464 464_splitncnn_0 464_splitncnn_1 464_splitncnn_2
Convolution      Conv_122                 1 1 390_splitncnn_1 717 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      Conv_123                 1 1 390_splitncnn_0 720 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_124            1 1 720 469 0=1.000000e-01
Split            splitncnn_9              1 2 469 469_splitncnn_0 469_splitncnn_1
Convolution      Conv_125                 1 1 469_splitncnn_1 723 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      Conv_126                 1 1 469_splitncnn_0 726 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_127            1 1 726 474 0=1.000000e-01
Convolution      Conv_128                 1 1 474 729 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           Concat_129               3 1 717 723 729 477 0=0
ReLU             Relu_130                 1 1 477 478
Split            splitncnn_10             1 3 478 478_splitncnn_0 478_splitncnn_1 478_splitncnn_2
Convolution      Conv_131                 1 1 450_splitncnn_2 479 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          Transpose_132            1 1 479 480 0=3
Reshape          Reshape_138              1 1 480 490 0=4 1=-1
Convolution      Conv_139                 1 1 464_splitncnn_2 491 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          Transpose_140            1 1 491 492 0=3
Reshape          Reshape_146              1 1 492 502 0=4 1=-1
Convolution      Conv_147                 1 1 478_splitncnn_2 503 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          Transpose_148            1 1 503 504 0=3
Reshape          Reshape_154              1 1 504 514 0=4 1=-1
Concat           Concat_155               3 1 490 502 514 output0 0=0
Convolution      Conv_156                 1 1 450_splitncnn_1 516 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          Transpose_157            1 1 516 517 0=3
Reshape          Reshape_163              1 1 517 527 0=2 1=-1
Convolution      Conv_164                 1 1 464_splitncnn_1 528 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          Transpose_165            1 1 528 529 0=3
Reshape          Reshape_171              1 1 529 539 0=2 1=-1
Convolution      Conv_172                 1 1 478_splitncnn_1 540 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          Transpose_173            1 1 540 541 0=3
Reshape          Reshape_179              1 1 541 551 0=2 1=-1
Concat           Concat_180               3 1 527 539 551 552 0=0
Convolution      Conv_181                 1 1 450_splitncnn_0 553 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          Transpose_182            1 1 553 554 0=3
Reshape          Reshape_188              1 1 554 564 0=10 1=-1
Convolution      Conv_189                 1 1 464_splitncnn_0 565 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          Transpose_190            1 1 565 566 0=3
Reshape          Reshape_196              1 1 566 576 0=10 1=-1
Convolution      Conv_197                 1 1 478_splitncnn_0 577 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          Transpose_198            1 1 577 578 0=3
Reshape          Reshape_204              1 1 578 588 0=10 1=-1
Concat           Concat_205               3 1 564 576 588 589 0=0
Softmax          Softmax_206              1 1 552 590 0=1 1=1
